"""Камень, ножницы, бумага, ящерица, Спок 🌶️"""

timur , ruslan = input(), input()
figure = {'камень': ['ножницы', 'ящерица'],
            'ножницы': ['бумага', 'ящерица'],
            'бумага': ['камень', 'Спок'],
            'Спок': ['ножницы', 'камень'],
            'ящерица': ['бумага', 'Спок']}

if timur == ruslan:
    print('ничья')
elif ruslan in figure[timur]:
    print('Тимур')
else:
    print('Руслан')

    
#   0 1 2 3 4
# 0 = + - + -
# 1 - = + - +
# 2 + - = + -
# 3 - + - = +
# 4 + - + - =